a = int(input("Введите число в диапозоне 10 - 40: "))
b = a // 10
dct1 = {
    10:"Десять",
    11:"Одиннадцать",
    12:"Двенадцать",
    13:"Тринадцать",
    14:"Четырнадцать",
    15:"Пятнадцать",
    16:"Шестнадцать",
    17:"Семнадцать",
    18:"Восемнадцать",
    19:"Девтнадцать",
}
dct2 = {
    2:"Двадцать",
    3:"Тридцать",
}
dct3 = {
    1:"одно",
    2:"два",
    3:"три",
    4:"четыре",
    5:"пять",
    6:"шесть",
    7:"семь",
    8:"восемь",
    9:"девять",
}
if a in range(10,20):
    print(dct1[a], "учебных заведений")
elif b in range(2,4):
    if a % 10 in range(2,10):
        print(dct2[b], dct3[a%10], "учебных заведений")
    elif a % 10 == 1:
        print(dct2[b], dct3[1], "учебное заведение")
    elif a % 10 == 0:
        print(dct[b], "учебных заведений")
else:
    print("Ввели некорректное число")
